## Plan Result (demo-global)




<pre><code>Plan: 44 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ac-int-gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ds-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;judicial-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-dn" -> "healthProbeSettings-hmi-apim"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/div-dn"
          ~ load_balancing_name = "loadBalancingSettings-div-dn" -> "loadBalancingSettings-hmi-apim"
          ~ name                = "div-dn" -> "hmi-apim"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-hmiapimdemo.uksouth.cloudapp.azure.com"
              ~ host_header = "decree-nisi-aks.demo.platform.hmcts.net" -> "hmi-apim.demo.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-da" -> "healthProbeSettings-div-dn"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/div-da"
          ~ load_balancing_name = "loadBalancingSettings-div-da" -> "loadBalancingSettings-div-dn"
          ~ name                = "div-da" -> "div-dn"

          ~ backend {
              ~ host_header = "decree-absolute-aks.demo.platform.hmcts.net" -> "decree-nisi-aks.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-rfe" -> "healthProbeSettings-div-da"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/div-rfe"
          ~ load_balancing_name = "loadBalancingSettings-div-rfe" -> "loadBalancingSettings-div-da"
          ~ name                = "div-rfe" -> "div-da"

          ~ backend {
              ~ host_header = "respond-divorce-aks.demo.platform.hmcts.net" -> "decree-absolute-aks.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-pfe" -> "healthProbeSettings-div-rfe"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/div-pfe"
          ~ load_balancing_name = "loadBalancingSettings-div-pfe" -> "loadBalancingSettings-div-rfe"
          ~ name                = "div-pfe" -> "div-rfe"

          ~ backend {
              ~ host_header = "petitioner-frontend-aks.demo.platform.hmcts.net" -> "respond-divorce-aks.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-tribunals" -> "healthProbeSettings-div-pfe"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/sscs-tribunals"
          ~ load_balancing_name = "loadBalancingSettings-sscs-tribunals" -> "loadBalancingSettings-div-pfe"
          ~ name                = "sscs-tribunals" -> "div-pfe"

          ~ backend {
              ~ host_header = "benefit-appeal.demo.platform.hmcts.net" -> "petitioner-frontend-aks.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-cor" -> "healthProbeSettings-sscs-tribunals"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/sscs-cor"
          ~ load_balancing_name = "loadBalancingSettings-sscs-cor" -> "loadBalancingSettings-sscs-tribunals"
          ~ name                = "sscs-cor" -> "sscs-tribunals"

          ~ backend {
              ~ host_header = "sscs-cor.demo.platform.hmcts.net" -> "benefit-appeal.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-tya" -> "healthProbeSettings-sscs-cor"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/sscs-tya"
          ~ load_balancing_name = "loadBalancingSettings-sscs-tya" -> "loadBalancingSettings-sscs-cor"
          ~ name                = "sscs-tya" -> "sscs-cor"

          ~ backend {
              ~ host_header = "track-appeal.demo.platform.hmcts.net" -> "sscs-cor.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-webapp" -> "healthProbeSettings-sscs-tya"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-webapp"
          ~ load_balancing_name = "loadBalancingSettings-xui-webapp" -> "loadBalancingSettings-sscs-tya"
          ~ name                = "xui-webapp" -> "sscs-tya"

          ~ backend {
              ~ host_header = "manage-case.demo.platform.hmcts.net" -> "track-appeal.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org" -> "healthProbeSettings-fact"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-manage-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org" -> "loadBalancingSettings-fact"
          ~ name                = "xui-manage-org" -> "fact"

          ~ backend {
              ~ host_header = "manage-org.demo.platform.hmcts.net" -> "fact.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org-int" -> "healthProbeSettings-fact-admin"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-manage-org-int"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org-int" -> "loadBalancingSettings-fact-admin"
          ~ name                = "xui-manage-org-int" -> "fact-admin"

          ~ backend {
              ~ host_header = "manage-org-int.demo.platform.hmcts.net" -> "fact-admin.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org" -> "healthProbeSettings-et-sya"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-approve-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org" -> "loadBalancingSettings-et-sya"
          ~ name                = "xui-approve-org" -> "et-sya"

          ~ backend {
              ~ host_header = "administer-orgs.demo.platform.hmcts.net" -> "et-sya.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact" -> "healthProbeSettings-xui-webapp"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fact"
          ~ load_balancing_name = "loadBalancingSettings-fact" -> "loadBalancingSettings-xui-webapp"
          ~ name                = "fact" -> "xui-webapp"

          ~ backend {
              ~ host_header = "fact.demo.platform.hmcts.net" -> "manage-case.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org-int" -> "healthProbeSettings-xui-manage-org"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-approve-org-int"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org-int" -> "loadBalancingSettings-xui-manage-org"
          ~ name                = "xui-approve-org-int" -> "xui-manage-org"

          ~ backend {
              ~ host_header = "administer-orgs-int.demo.platform.hmcts.net" -> "manage-org.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact-admin" -> "healthProbeSettings-xui-manage-org-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fact-admin"
          ~ load_balancing_name = "loadBalancingSettings-fact-admin" -> "loadBalancingSettings-xui-manage-org-int"
          ~ name                = "fact-admin" -> "xui-manage-org-int"

          ~ backend {
              ~ host_header = "fact-admin.demo.platform.hmcts.net" -> "manage-org-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-sya" -> "healthProbeSettings-xui-approve-org"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/et-sya"
          ~ load_balancing_name = "loadBalancingSettings-et-sya" -> "loadBalancingSettings-xui-approve-org"
          ~ name                = "et-sya" -> "xui-approve-org"

          ~ backend {
              ~ host_header = "et-sya.demo.platform.hmcts.net" -> "administer-orgs.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-gateway-ccd" -> "healthProbeSettings-xui-approve-org-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/gateway-ccd"
          ~ load_balancing_name = "loadBalancingSettings-gateway-ccd" -> "loadBalancingSettings-xui-approve-org-int"
          ~ name                = "gateway-ccd" -> "xui-approve-org-int"

          ~ backend {
              ~ host_header = "gateway-ccd.demo.platform.hmcts.net" -> "administer-orgs-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-gateway-ccd-int" -> "healthProbeSettings-xui-register-org"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/gateway-ccd-int"
          ~ load_balancing_name = "loadBalancingSettings-gateway-ccd-int" -> "loadBalancingSettings-xui-register-org"
          ~ name                = "gateway-ccd-int" -> "xui-register-org"

          ~ backend {
              ~ host_header = "gateway-ccd-int.demo.platform.hmcts.net" -> "register-org.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-register-org" -> "healthProbeSettings-gateway-ccd"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-register-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-register-org" -> "loadBalancingSettings-gateway-ccd"
          ~ name                = "xui-register-org" -> "gateway-ccd"

          ~ backend {
              ~ host_header = "register-org.demo.platform.hmcts.net" -> "gateway-ccd.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-ac-int-gateway-ccd" -> "healthProbeSettings-gateway-ccd-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/ac-int-gateway-ccd"
          ~ load_balancing_name = "loadBalancingSettings-ac-int-gateway-ccd" -> "loadBalancingSettings-gateway-ccd-int"
          ~ name                = "ac-int-gateway-ccd" -> "gateway-ccd-int"

          ~ backend {
              ~ host_header = "ac-int-gateway-ccd.demo.platform.hmcts.net" -> "gateway-ccd-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pcq" -> "healthProbeSettings-ac-int-gateway-ccd"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/pcq"
          ~ load_balancing_name = "loadBalancingSettings-pcq" -> "loadBalancingSettings-ac-int-gateway-ccd"
          ~ name                = "pcq" -> "ac-int-gateway-ccd"

          ~ backend {
              ~ host_header = "pcq.demo.platform.hmcts.net" -> "ac-int-gateway-ccd.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pcq-int" -> "healthProbeSettings-pcq"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/pcq-int"
          ~ load_balancing_name = "loadBalancingSettings-pcq-int" -> "loadBalancingSettings-pcq"
          ~ name                = "pcq-int" -> "pcq"

          ~ backend {
              ~ host_header = "pcq-int.demo.platform.hmcts.net" -> "pcq.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-lau" -> "healthProbeSettings-pcq-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/lau"
          ~ load_balancing_name = "loadBalancingSettings-lau" -> "loadBalancingSettings-pcq-int"
          ~ name                = "lau" -> "pcq-int"

          ~ backend {
              ~ host_header = "lau.demo.platform.hmcts.net" -> "pcq-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-lau-int" -> "healthProbeSettings-lau"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/lau-int"
          ~ load_balancing_name = "loadBalancingSettings-lau-int" -> "loadBalancingSettings-lau"
          ~ name                = "lau-int" -> "lau"

          ~ backend {
              ~ host_header = "lau-int.demo.platform.hmcts.net" -> "lau.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-judicial-payments" -> "healthProbeSettings-lau-int"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/judicial-payments"
          ~ load_balancing_name = "loadBalancingSettings-judicial-payments" -> "loadBalancingSettings-lau-int"
          ~ name                = "judicial-payments" -> "lau-int"

          ~ backend {
              ~ host_header = "judicial-payments.demo.platform.hmcts.net" -> "lau-int.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-adoption-web" -> "healthProbeSettings-judicial-payments"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/adoption-web"
          ~ load_balancing_name = "loadBalancingSettings-adoption-web" -> "loadBalancingSettings-judicial-payments"
          ~ name                = "adoption-web" -> "judicial-payments"

          ~ backend {
              ~ host_header = "adoption-web.demo.platform.hmcts.net" -> "judicial-payments.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-probate" -> "healthProbeSettings-adoption-web"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/probate"
          ~ load_balancing_name = "loadBalancingSettings-probate" -> "loadBalancingSettings-adoption-web"
          ~ name                = "probate" -> "adoption-web"

          ~ backend {
              ~ host_header = "probate.demo.platform.hmcts.net" -> "adoption-web.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-web-public" -> "healthProbeSettings-probate"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/idam-web-public"
          ~ load_balancing_name = "loadBalancingSettings-idam-w

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["paybubble-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/paybubble-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pcq"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pcq"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pcq-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/pcq-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["privatelaw"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/privatelaw"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["probate"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/probate"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["rpts"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/rpts"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sptribs-frontend"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sptribs-frontend"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-cor"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-cor"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-tribunals"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-tribunals"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sscs-tya"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/sscs-tya"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-approve-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-approve-org-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-approve-org-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-manage-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-manage-org-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-manage-org-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-register-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-register-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "wildcard-demo-platform-hmcts-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmi-apim"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "hmiapimdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 44 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1475,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->